[Language]
Language=Русский
LangId=25
SubLangId=1

[Public]
Object=(Name=Core.HelloWorldCommandlet,Class=Class,MetaClass=Core.Commandlet)
Preferences=(Caption="Дополнительно",Parent="Спецнастройки")
Preferences=(Caption="Файловая система",Parent="Дополнительно",Class=Core.System,Immediate=True)

[Errors]
Unknown=Неизвестная ошибка
Aborted=Прервано
ExportOpen=Ошибка экспорта %s: невозможно открыть файл '%s'
ExportWrite=Ошибка экспорта %s: невозможно записать файл '%s'
FileNotFound=Невозможно найти файл '%s'
ObjectNotFound=Не удалось найти объект '%s %s.%s'
PackageNotFound=Невозможно найти файл для пакета '%s'
PackageResolveFailed=Невозможно получить имя пакета
FilenameToPackage=Невозможно преобразовать имя файла '%s' к имени пакета
Sandbox=Пакет '%s' не доступен в этой ограниченной среде
PackageVersion=Версия пакета '%s' не подходит
FailedLoad=Не удалось загрузить '%s': %s
ConfigNotFound=Не возможно найти '%s' в конфигурационном файле
LoadClassMismatch=%s не является дочерним классом %s.%s
NotDll='%s' не пакет DLL; невозможно найти экспорт '%s'
NotInDll=Невозможно найти '%s' в '%s.dll'
FailedLoadPackage=Не удалось загрузить пакет: %s
FailedLoadObject=Не удалось загрузить '%s %s.%s': %s
TransientImport=Временный объект импортирован: %s
FailedSavePrivate=Невозможно сохранить %s: Граф связан с внешним частным объектом %s
FailedImportPrivate=Невозможно импортировать частный объект %s %s
FailedCreate=%s %s не найден для создания
FailedImport=Невозможно найти %s в файле '%s'
FailedSaveFile=Ошибка сохранения файла '%s': %s
SaveWarning=Ошибка сохранения '%s'
NotPackaged=Объект не упакован: %s %s
NotWithin=Объект %s %s создан в %s вместо %s
Abstract=Невозможно создать объект %s: класс %s является абстрактным
NoReplace=Невозможно заменить %s на %s
NoFindImport=Невозможно найти файл '%s' для импорта
ReadFileFailed=Не удалось прочитать файл '%s' для импорта
SeekFailed=Ошибка поиска файла
OpenFailed=Ошибка открытия файла
WriteFailed=Ошибка записи в файл
ReadEof=Чтение за пределами конца файла
IniReadOnly=Файл %s защищен от записи; установки не могут быть сохранены
UrlFailed=Не удалось запустить URL
Warning=Внимание
Question=Вопрос
OutOfMemory=Виртуальная память кончилась. Чтобы избежать подобного, вы должны освободить больше места на своем основном жестком диске.
History=История
Assert=Утверждение неверно: %s [Файл:%s] [Строка: %i]
Debug=Утверждение отладки неверно: %s [Файл:%s] [Строка: %i]
LinkerExists=Линкер для '%s' уже создан
BinaryFormat=Файл '%s' содержит неопознанные данные
SerialSize=%s: Последовательный размер не подходит: Получено %i, Ожидалось %i
ExportIndex=Плохой индекс экспорта %i/%i
ImportIndex=Плохой индекс импорта %i/%i
Password=Пароль не опознан
Exec=Неопознанная команда
BadProperty='%s': Плохое или потерянное свойство '%s'
MisingIni=Отсутствующий .ini файл: %s

[Query]
OldVersion=Файл %s был сохранен предыдущей версией, которая не имеет обратной совместимости с данной.  Наиболее вероятно, что его чтение приведет к ошибке и может вызвать падение. Вы хотите попробовать в любом случае?
Name=Имя:
Password=Пароль:
PassPrompt=Введите свое имя и пароль:
PassDlg=Проверка идентификации
Overwrite=Требуется обновить файл '%s'.  Вы хотите перезаписать существующую версию?

[Progress]
Saving=Сохраняется файл %s...
Loading=Загружается файл %s...
Closing=Закрытие

[General]
Product=Mobile Forces
Engine=Unreal Engine
Copyright=Авторские права 1999 Epic Games, Inc.
True=Правда
False=Ложь
None=Нет
Yes=Да
No=Нет

[SimpleCommandlet]
HelpCmd=Просто
HelpOneLiner=Просто
HelpUsage=Просто

[HelloWorldCommandlet]
HelpCmd=ПриветМир
HelpOneLiner=Пример
HelpUsage=ПриветМир
HelpParm[0]=IntParm
HelpParm[1]=StrParm
HelpDesc[0]=Целый параметр
HelpDesc[1]="Строковый параметр"

